SuperSuave/can-do/firmware/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32c3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Flash size configuration (4MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Web server WebSocket support (required for /ws endpoint and live logs)
CONFIG_HTTPD_WS_SUPPORT=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000

# Increase maximum open sockets so HTTP, WebSocket, MQTT, and GVRET can operate concurrently
CONFIG_LWIP_MAX_SOCKETS=16

# Default DHCP and network hostname
CONFIG_LWIP_LOCAL_HOSTNAME="can-do"

# Native Bluetooth Low Energy (BLE) & NimBLE Configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_MAX_BONDS=5
CONFIG_BT_NIMBLE_MAX_CCCDS=8

